{
    "common": {
        "appAccronym": "Catalogue des logiciels de la recherche académique"
    },
    "softwareFormStep2": {
        "external id": "Fiche HAL",
        "external id hint_fill": "Renseignez le nom du logiciel ou directement l'identifiant  (attention, les identifiants HAL sont de la forme  hal-123123v1, il faut fournir uniquement le numéro (sans  'hal-' et sans version), dans ce cas '123123') pour associer  le logiciel à une fiche existante<space /><dataSource>HAL</dataSource>. <br /> La plupart des informations générales, telles que l'URL du  dépôt de code, sont extraites de HAL. Si le logiciel que vous  souhaitez ajouter ne possède pas encore de fiche sur HAL, vous  pouvez en créer une. Vous trouverez ici un <space /><exampleUrl>exemple de fiche HAL </exampleUrl>  ."
    },
    "home": {
        "title": "Référencement de logiciels libres",
        "subTitle": "développés dans l'enseignement supérieur et la recherche.",
        "helpUs": "Aidez-nous à enrichir le catalogue !",
        "theSillInAFewWordsParagraph": "<p>Le logiciel est aujourd’hui devenu indispensable dans tous les domaines de la recherche scientifique, à la fois comme outil pour la recherche, comme produit de la recherche et comme objet de recherche.</p><p>Un des objectifs majeurs du collège <a1>« Codes sources et logiciel »</a1> est de mettre en lumière ces productions et leur importance pour la recherche.</p><p>Ce catalogue est par ailleurs inscrit dans les ambitions du <a2>Plan National pour la Science Ouverte</a2>.</p>",
        "addSoftwareOrServiceTitle": "Ajouter un logiciel / Contribuer",
        "addSoftwareOrServiceDesc": "<p>Le catalogue se base sur les notices logicielles déposées dans l'archive ouverte <a1>HAL</a1>.</p><p>Pour déposer une notice logicielle, vous pouvez vous reporter à la documentation de HAL.</p>",
        "addSoftwareOrServiceButtonLabel": "Voir documentation HAL",
        "editSoftwareTitle": "Modifier une fiche logiciel",
        "editSoftwareDesc": "<p>Le catalogue se base sur les notices logicielles déposées dans l'archive ouverte <a1>HAL</a1>.</p><p>Pour modifier une fiche logicielle, il faut donc aller modifier sa notice dans HAL.</p>",
        "editSoftwareButtonLabel": "Se connecter à HAL"
    },
    "about": {
        "text": "# À propos du site\n ## Introduction\n Le [logiciel](https://www.ouvrirlascience.fr/le-logiciel-de-recherche-un-pilier-de-la-recherche-scientifique-ouverte/) est aujourd'hui devenu indispensable dans tous les domaines de la recherche scientifique, à la fois comme outil pour la recherche, comme produit de la recherche et comme objet de recherche.\n\n Un des objectifs majeurs du collège [« Codes sources et logiciel »](https://www.ouvrirlascience.fr/college-codes-sources-et-logiciels/) est de mettre en lumière ces productions et leur importance pour la recherche.\n\n Ce catalogue est par ailleurs inscrit dans les ambitions du [Plan National pour la Science Ouverte](https://www.ouvrirlascience.fr/deuxieme-plan-national-pour-la-science-ouverte/).\n\n Ce catalogue fait suite à la réalisation d'un [état des lieux](https://www.ouvrirlascience.fr/vers-un-catalogue-national-des-logiciels-issus-de-la-recherche/) sur le sujet du référencement des logiciels, dans le cadre d'une approche globale incluant à la fois les pratiques des communautés scientifiques, les infrastructures associées, les schémas de métadonnées, les catalogues existants et l'écosystème de l'accompagnement.\n\n Cette étude a permis d'identifier les points clés pour la réalisation d'un catalogue des logiciels issus des laboratoires de recherche académiques :\n - S'inscrire dans l'écosystème des communautés de recherche\n - Minimiser le travail pour le chercheur en automatisant les process et en évitant les re-saisies \n- Assurer une certaine qualité des entrées en intégrant au minimum une procédure de modération\n - Utiliser l'existant\n - Anticiper les MAJ de façon la plus automatique possible\n - Assurer la cohérence avec d'autres initiatives nationales, européennes et internationales\n\n Ces éléments, associés à l'analyse réalisée dans cette étude, ont conduit à effectuer des choix d'infrastructures et d'outils pour la constitution du catalogue.\nLa version actuelle est un tout premier prototype qui vise à montrer la faisabilité du projet, récolter les retours de la communauté les plus larges possibles et consolider la feuille de route en cours de construction.\n ## Constitution du catalogue\n Le catalogue repose sur trois éléments complémentaires et structurants :\n - L’archive HAL constitue la base de données principale du catalogue, les notices logicielles disposant d'un SWHID sont moissonnées et affichées dans le catalogue.\n - L'outil de catalogue développé en logiciel libre par la DINUM et utilisé par le SILL (Socle Interministériel des Logiciels Libres) est le portail d'affichage du catalogue. Les développements ont consisté à l'adapter aux besoins de la recherche et à aller vers un outil plus générique.\n - Les éléments du code archivés sur Software Heritage sont accessibles via le Software Heritage Identifier inclus dans la notice HAL.\n \nCette architecture répond aux points clés exprimés ci-dessus :\n - HAL est une infrastructure bien connue de la communauté scientifique, y compris des plus jeunes chercheurs.\n - HAL est une infrastructure intégrée dans l'écosystème académique européen.\n - La création d'une notice HAL est l'unique étape pour que le logiciel apparaisse dans le catalogue. Elle sera d'autant plus simple si de bonnes pratiques telles que l'utilisation d'une forge, la description du logiciel via un fichier [CodeMeta](https://codemeta.github.io/), ont été suivies. Dans ce cas, HAL récupère automatiquement les métadonnées à partir du SWHID et du fichier CodeMeta.\n - HAL applique une modération aux notices logicielles, garantissant une qualité minimale des métadonnées (en particulier auteurs et affiliation).\n - La mise en commun avec la [DINUM](https://www.numerique.gouv.fr/dinum/) des développements sur l'[outil de catalogue](https://github.com/codegouvfr/sill) permet de mutualiser les efforts.\n - La périodicité du moissonnage est de 24h, garantissant que les éléments les plus dynamiques des fiches logicielles (en particulier sur les statistiques de développement) sont à jour.\n ## Feuille de route envisagée\n Cette première version vise à montrer la faisabilité de référencer des logiciels en allant chercher sur différentes sources (actuellement HAL et les dépôts des logiciels), tout en répondant aux points clés identifiés.\n\n La feuille de route pour les prochaines évolutions pourrait comprendre plusieurs axes, mais dépendra des financements qui pourront être obtenus pour consolider le projet.\n ## Le moissonnage multi-sources\n Il existe d'autres sources de données où sont référencés les logiciels. Zenodo en est un exemple emblématique.\n\n L'un des prochains objectifs du projet de catalogue sera de moissonner les logiciels présents dans Zenodo. Ce développement se fera dans le cadre du projet européen [LUMEN](https://eosc.eu/eu-project/eosc-lumen/), donc sur un périmètre plus large en terme territorial.\n\n L'un des points qu'il faudra prendre en compte en comparaison du moissonnage HAL, c'est qu'il n'existe pas de modération globale sur Zenodo et donc la qualité des métadonnées (en particulier auteurs et affiliation) n'est absolument pas garantie.\n\n Il s'agira également d'identifier d'autres sources potentiellement pertinentes pour le catalogue.\n ## L'ajout de fonctionnalités\n Plusieurs fonctionnalités sont envisagées dans la feuille de route, à court ou plus long terme :\n - Proposer des vues chercheur / laboratoire / institution\n - Implémenter de la traduction automatique afin d'avoir un vrai site bilingue\n - Permettre des ajouts en interactif et des données propres au catalogue. Cette fonctionnalité va nécessiter l'authentification des contributeurs ainsi qu'une étape de modération. On peut imaginer pouvoir compléter les fiches logicielles avec :\n    - des retours utilisateurs,\n     - des commentaires voir des discussions au format forum par exemple, ...\n ### L'enrichissement des entrées\n #### Autour des éléments propres au logiciel\n La version actuelle récupère des données sur HAL et sur le dépôt du logiciel lorsqu'il est hébergé sur GitHub ou sur une instance GitLab.\n\n Cela limite l'affichage de ces métadonnées à ces types de forge (même si elles sont très majoritaires). L'objectif serait d'avoir une approche plus homogène et plus globale en récupérant ces données sur Software Heritage.\n\n Il s'agira aussi de bien identifier les indicateurs pertinents à afficher.\n #### Autour du lien avec d'autres productions scientifiques\n Une des plus-values du catalogue pour des logiciels issus des laboratoires de recherche est de pouvoir faire le lien avec d'autres produits de recherche comme les publications et les données. Pour cela, mais aussi pour identifier de nouvelles entrées au catalogue, on pourrait s'appuyer sur les outils du baromètre pour la science ouverte en utilisant les mentions de logiciels détectées dans les publications.\n\n Cette feuille de route n'est évidemment pas exhaustive et évoluera en fonction des retours de la communauté et des financements qui permettront de soutenir le projet. Elle s'inscrit sur du court à long terme en fonction des éléments.\n En parallèle de cette feuille de route technique, des travaux sont en cours avec les équipes du CCSD (qui développe et exploite HAL) autour de l'évolution de la modération des notices logicielles.\n\n Enfin, au niveau plus stratégique, des réflexions sont en cours pour travailler sur la pérennisation du catalogue.\n ## L'importance des retours de la communauté\n L'ouverture de cette version beta du catalogue vise à récolter les retours de notre communauté recherche académique au sens large. Il s'agit de s'assurer que la démarche proposée répond bien aux besoins des différents membres de cette communauté, que ce soit des chercheurs, ingénieurs, doctorants, responsables à différents niveaux, personnels des bibliothèques, services de valorisation...\n\n N'hésitez donc pas à compléter le questionnaire visant à recueillir vos avis : [https://gricad-limesurvey.univ-grenoble-alpes.fr/index.php/591154?lang=fr](https://gricad-limesurvey.univ-grenoble-alpes.fr/index.php/591154?lang=fr.).\n\n Vos remarques et commentaires nous permettront d'affiner la feuille de route, mais aussi d'avoir un poids (selon le nombre !) pour faire levier pour obtenir de nouveaux financements pour la mettre en œuvre.\n ### Contact\n Pour toute question, commentaires, échanges, n'hésitez pas à contacter le groupe en charge du projet : [contact-logiciels-catalogue-esr@groupes.renater.fr](mailto:contact-logiciels-catalogue-esr@groupes.renater.fr)"
    },
    "header": {
        "home title": "Accueil - Catalogue des logiciels de la recherche académique",
        "title": "Catalogue des logiciels de la recherche académique",
        "navigation welcome": "Bienvenue sur le catalogue",
        "navigation support request": "Contact !"
    },
    "headerDetailCard": {
        "website": "Notice HAL"
    }
}
