{
    "common": {
        "appAccronym": "Catalog of free software "
    },
    "app": {
        "title": "Catalog of academic research free software"
    },
    "softwareFormStep2": {
        "external id": "HAL item",
        "external id hint_fill": "Fill up a name or directly the id (careful, HAL ids look like 'hal-123123v1', but only the number should be provided  (without 'hal-' or the version), in this case it should be  '123123') to associate the software with an existing entry <space /><dataSource>Wikidata</dataSource>. <br />Most general information, such as the URL of the code  repository, is extracted from HAL. If the software you want to  add does not have a Hal entry yet, you can create one. Find here an<space /><exampleUrl>example of an HAL entry</exampleUrl>"
    },
    "home": {
        "title": "Listing of free software",
        "subTitle": "developped in academic research.",
        "helpUs": "Help us to enhance the research software list !",
        "theSillInAFewWordsParagraph": "<p>Software has become essential in all scientific research fields, serving as both a tool for research, a product of research, and a subject of research.</p><p>A major objective of the <a1>Software and Source Code Committee</a1> is to highlight these productions and their significance to research.</p><p>This catalog is also part of the broader goals of the <a2>French National Plan for Open Science</a2>.</p>",
        "addSoftwareOrServiceTitle": "Add Software / Contribute",
        "addSoftwareOrServiceDesc": "<p>The catalog relies on software notices uploaded to the open archive <a1>HAL</a1>.</p><p>For submitting a software notice, please refer to HAL's documentation.</p>",
        "addSoftwareOrServiceButtonLabel": "View HAL Documentation",
        "editSoftwareTitle": "Edit Software Sheet",
        "editSoftwareDesc": "<p>The catalog is based on software notices deposited in the open archive <a1>HAL</a1>.</p><p>To edit a software sheet, you must go to modify its notice in HAL.</p>",
        "editSoftwareButtonLabel": "Connect to HAL"
    },
    "about": {
        "text": "# About the Site\n ## Introduction\n [Software](https://www.ouvrirlascience.fr/le-logiciel-de-recherche-un-pilier-de-la-recherche-scientifique-ouverte/) has become indispensable in all areas of scientific research, serving as a tool for research, a product of research, and an object of research.\n \n One of the major objectives of the [“Source Code and Software”](https://www.ouvrirlascience.fr/college-codes-sources-et-logiciels/) committee is to highlight these productions and their importance for research.\n \n This catalog is also part of the ambitions of the [National Plan for Open Science](https://www.ouvrirlascience.fr/deuxieme-plan-national-pour-la-science-ouverte/).\n \n This catalog follows the creation of a [state of the art](https://www.ouvrirlascience.fr/vers-un-catalogue-national-des-logiciels-issus-de-la-recherche/) on the subject of software referencing, within a global approach including both the practices of scientific communities, associated infrastructures, metadata schemas, existing catalogs, and the support ecosystem.\n \n This study identified key points for the creation of a catalog of software from academic research laboratories:\n - Fit into the ecosystem of research communities\n - Minimize the work for the researcher by automating processes and avoiding re-entries\n - Ensure a certain quality of entries by integrating at least a moderation procedure\n - Use existing resources\n - Anticipate updates as automatically as possible\n - Ensure consistency with other national, European, and international initiatives\n \n These elements, combined with the analysis conducted in this study, led to the selection of infrastructures and tools for the creation of the catalog. The current version is a very first prototype aimed at demonstrating the feasibility of the project, gathering the broadest possible feedback from the community, and consolidating the roadmap under construction.\n \n ## Catalog Constitution\n The catalog is based on three complementary and structuring elements:\n - The HAL archive serves as the main database of the catalog, with software notices having a SWHID being harvested and displayed in the catalog.\n - The catalog tool developed as free software by the DINUM and used by the SILL (Interministerial Base of Free Software) is the portal for displaying the catalog. The developments consisted of adapting it to the needs of research and moving towards a more generic tool.\n - The code elements archived on Software Heritage are accessible via the Software Heritage Identifier included in the HAL notice.\n \n This architecture addresses the key points expressed above:\n - HAL is a well-known infrastructure in the scientific community, including younger researchers.\n - HAL is an infrastructure integrated into the European academic ecosystem.\n - The creation of a HAL notice is the only step required for the software to appear in the catalog. It will be even simpler if good practices such as the use of a forge, the description of the software via a [CodeMeta](https://codemeta.github.io/) file, have been followed. In this case, HAL automatically retrieves the metadata from the SWHID and the CodeMeta file.\n - HAL applies moderation to software notices, ensuring a minimum quality of metadata (especially authors and affiliation).\n - Sharing developments on the [catalog tool](https://github.com/codegouvfr/sill) with the [DINUM](https://www.numerique.gouv.fr/dinum/) allows for mutualization of efforts.\n - The harvesting periodicity is 24 hours, ensuring that the most dynamic elements of the software sheets (especially development statistics) are up to date.\n \n ## Envisioned Roadmap\n This first version aims to demonstrate the feasibility of referencing software by drawing from different sources (currently HAL and software repositories), while addressing the identified key points.\n \n The roadmap for future developments could include several axes but will depend on the funding that can be obtained to consolidate the project.\n \n ## Multi-source Harvesting\n There are other data sources where software is referenced. Zenodo is a prime example.\n \n One of the next objectives of the catalog project will be to harvest the software present in Zenodo. This development will take place within the European [LUMEN](https://eosc.eu/eu-project/eosc-lumen/) project, thus covering a broader territorial scope.\n \n One point to consider in comparison to HAL harvesting is that there is no global moderation on Zenodo, and therefore the quality of metadata (especially authors and affiliation) is not guaranteed at all.\n \n It will also be necessary to identify other potentially relevant sources for the catalog.\n \n ## Adding Functionalities\n Several functionalities are envisioned in the roadmap, in the short or longer term:\n - Provide researcher / laboratory / institution views\n - Implement automatic translation to have a truly bilingual site\n - Allow interactive additions and data specific to the catalog. This functionality will require the authentication of contributors as well as a moderation step. We can imagine being able to complete the software sheets with:\n   - user feedback,\n   - comments or even discussions in a forum format, for example, ...\n \n ### Enriching Entries\n #### Around Elements Specific to Software\n The current version retrieves data from HAL and from the software repository when it is hosted on GitHub or on a GitLab instance.\n \n This limits the display of these metadata to these types of forges (even if they are very predominant). The objective would be to have a more homogeneous and global approach by retrieving this data from Software Heritage.\n \n It will also be necessary to clearly identify the relevant indicators to display.\n \n #### Around the Link with Other Scientific Productions\n One of the added values of the catalog for software from research laboratories is the ability to link with other research products such as publications and data. To do this, but also to identify new entries in the catalog, we could rely on the tools of the open science barometer by using the mentions of software detected in publications.\n \n This roadmap is obviously not exhaustive and will evolve according to the feedback from the community and the funding that will support the project. It ranges from short to long term depending on the elements. In parallel with this technical roadmap, work is underway with the CCSD teams (which develop and operate HAL) around the evolution of the moderation of software notices.\n \n Finally, at a more strategic level, reflections are underway to work on the sustainability of the catalog.\n \n ## Importance of Community Feedback\n The opening of this beta version of the catalog aims to gather feedback from our broad academic research community. The goal is to ensure that the proposed approach meets the needs of the different members of this community, whether they are researchers, engineers, PhD students, managers at different levels, library staff, or valorization services.\n \n Do not hesitate to complete the [questionnaire aimed at gathering your opinions](https://gricad-limesurvey.univ-grenoble-alpes.fr/index.php/591154?lang=fr).\n \n Your comments and feedback will help us refine the roadmap and also give us weight (depending on the number!) to leverage for obtaining new funding to implement it.\n \n ### Contact\n For any questions, comments, or exchanges, please do not hesitate to contact the group in charge of the project: [contact-logiciels-catalogue-esr@groupes.renater.fr](mailto:contact-logiciels-catalogue-esr@groupes.renater.fr)\n "
    },
    "header": {
        "siteTitle": "Ministère<br />chargé<br />de l'enseignement <br />supérieur <br />et de la recherche<br />",
        "home title": "Home - Catalog of academic research free software",
        "title": "Catalog of academic research free software",
        "navigation welcome": "Welcome on the catalog",
        "navigation support request": "Contact us !"
    },
    "headerDetailCard": {
        "website": "HAL Notice"
    }
}
